# Banco de Dados

Até agora vimos como salvar os dados em variáveis e arquivos, é hora de persistir os dados em Bancos.

In [1]:
# Instalando o pymysql
!pip install pymysql

Requirement already satisfied: pymysql in /home/joselino/anaconda3/lib/python3.7/site-packages (0.9.3)

In [ ]:
# Prepare o ambiente criando o banco e tabelas
# CREATE DATABASE db_sistema;
# USE db_sistema;
# CREATE TABLE usuarios (usu_id INTEGER AUTO_INCREMENT PRIMARY KEY, usu_usuario VARCHAR(20), usu_senha VARCHAR(15));

# SGBD MySQL

In [2]:
import pymysql

In [4]:
# Cria a conexão
con = pymysql.connect(host='localhost', user='root', passwd='admin', database='db_sistema')

In [5]:
# Cria cursor para manipular os dados
cur = con.cursor()

In [6]:
# Executa Query - Insere dados
cur.execute("INSERT INTO usuarios (usu_usuario, usu_senha) VALUES('admin', 'admin')")

1

In [14]:
# Retorna 1 se contém dados
cur.execute('SELECT * FROM usuarios')

1

In [17]:
# Lista os dados
lista = cur.fetchall()
for l in lista:
    print(l)

(1, 'admin', 'admin')

In [19]:
# Criar mais tabelas
cur.execute('CREATE TABLE IF NOT EXISTS clientes (cli_id INT(5), cli_nome VARCHAR(50), cli_telefone VARCHAR(20), cli_datanasc DATE)')

0

In [52]:
# Inserir dados
cur.execute("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'André', '998876543', '2020-10-12')")

1

## Otimizando com funções e Pandas

In [79]:
# Uma biblioteca fantástica para manipulação de dados
import pandas as pd

In [80]:
def conexao():
    con = pymysql.connect(host='localhost', user='root', passwd='admin', database='db_sistema', autocommit=True)
    return con

In [81]:
def consulta(query):
    con = conexao()
    cur = con.cursor()
    exe = cur.execute(query)
    
    try:
        if cur.rowcount > 0:
            df = pd.read_sql(query, con)
            return df
    except:
        print('Erro na execução da Query!')

In [82]:
consulta('SELECT * FROM clientes')

   cli_id   cli_nome cli_telefone cli_datanasc
0       1      André    998876543   2020-10-12
1       1      Lucas    998876543   1980-03-14
2       1   Veronica     98123456   2000-04-11
3       1      Kelly    998876543   1990-10-20
4       1      Maria     89765423   1989-08-30
5       1    Marília     99881234   2001-12-23
6       1      Maria      9865432   1998-01-28
7       2      Luiza         None   1981-10-14
8       3  Ana Luiza     93456789   1992-10-23

In [58]:
# Mais dados
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'Lucas', '998876543', '1980-03-14')")
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'Veronica', '98123456', '2000-04-11')")
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'Kelly', '998876543', '1990-10-20')")
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'Maria', '89765423', '1989-08-30')")
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'Marília', '99881234', '2001-12-23')")
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_telefone, cli_datanasc) VALUES (1, 'Maria', '9865432', '1998-01-28')")

In [60]:
# Colunas específicas
consulta("INSERT INTO clientes (cli_id, cli_nome, cli_datanasc) VALUES (2, 'Luiza', '1981-10-14')")

In [61]:
# Sem passar as colunas
consulta("INSERT INTO clientes VALUES (3, 'Ana Luiza', '93456789', '1992-10-23')")

In [83]:
consulta('SELECT * FROM clientes')

   cli_id   cli_nome cli_telefone cli_datanasc
0       1      André    998876543   2020-10-12
1       1      Lucas    998876543   1980-03-14
2       1   Veronica     98123456   2000-04-11
3       1      Kelly    998876543   1990-10-20
4       1      Maria     89765423   1989-08-30
5       1    Marília     99881234   2001-12-23
6       1      Maria      9865432   1998-01-28
7       2      Luiza         None   1981-10-14
8       3  Ana Luiza     93456789   1992-10-23

In [63]:
# Distintos - Sem nomes repetidos
consulta('SELECT DISTINCT cli_nome FROM clientes')

('André',)
('Lucas',)
('Veronica',)
('Kelly',)
('Maria',)
('Marília',)
('Luiza',)
('Ana Luiza',)

In [64]:
# Where
consulta('SELECT * FROM clientes WHERE cli_nome = "Maria"')

(1, 'Maria', '89765423', datetime.date(1989, 8, 30))
(1, 'Maria', '9865432', datetime.date(1998, 1, 28))

# SGBD Postgre

In [1]:
#pip install psycopg2
import psycopg2

In [33]:
# Conexão
conexao = psycopg2.connect(host="localhost", database="db_sistema", user="postgres", password="admin", port=5432)

In [34]:
# Cria um cursor
cursor = conexao.cursor()

In [35]:
# Salvando dados - No PGadmin
cursor.execute("INSERT INTO clientes VALUES (3, 'Ana Luiza', '93456789', '1992-10-23')")

In [36]:
# Executa
cursor.execute("SELECT * FROM clientes")

In [37]:
# Recupera todos os registros
registros = cursor.fetchall()

In [38]:
print(registros)

[(3, 'Ana Luiza', '93456789', datetime.date(1992, 10, 23)), (3, 'Ana Luiza', '93456789', datetime.date(1992, 10, 23))]

In [41]:
# Percorre os registros e imprime
for row in registros:
    print("Nome = ", row[1])
    print("Telefone  = ", row[2], "\n")

Nome =  Ana Luiza
Telefone  =  93456789

Nome =  Ana Luiza
Telefone  =  93456789